In [2]:
import pandas as pd

In [3]:
df=pd.read_csv(r"C:\python code\machine learning\2.multiple_linear_regression\hiring.csv")
df.head()

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000